# THURSDAY 13TH NOVEMBER, 2027
## TITANIC DATASET

### Cleaning and loading dataset

In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score,recall_score,f1_score,precision_score,confusion_matrix,classification_report
import statsmodels.api as sm
from sklearn.preprocessing import StandardScaler, LabelEncoder

In [2]:
titanic_data = pd.read_csv(r'tested.csv')
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [4]:
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [5]:
titanic_data['Age']= titanic_data['Age'].fillna(titanic_data['Age'].median())
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          418 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [6]:
titanic_data['Fare']= titanic_data['Fare'].fillna(titanic_data['Fare'].median())
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          418 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         418 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [7]:
titanic_data = titanic_data.drop(columns='Cabin', axis=1)
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [8]:
identity = titanic_data[['PassengerId','Name','Ticket']]
identity.head()

   PassengerId                                          Name   Ticket
0          892                              Kelly, Mr. James   330911
1          893              Wilkes, Mrs. James (Ellen Needs)   363272
2          894                     Myles, Mr. Thomas Francis   240276
3          895                              Wirz, Mr. Albert   315154
4          896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  3101298

### Onehotencoding get dummies pclass and embarked 
- nominal data

In [9]:
titanic_data = pd.get_dummies(titanic_data,columns=['Pclass','Embarked'], drop_first=True, dtype=int)
titanic_data.head()
# we drop to avoid multicollinearity

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,892,0,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,0,1,1,0
1,893,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,0,1,0,1
2,894,0,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,1,0,1,0
3,895,0,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,0,1,0,1
4,896,1,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,0,1,0,1

### Label encoding sex column
- ordinal and binary data

In [11]:
le = LabelEncoder()
titanic_data['Sex']= le.fit_transform(titanic_data['Sex'])
titanic_data.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,892,0,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,0,1,1,0
1,893,1,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,0,1,0,1
2,894,0,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,1,0,1,0
3,895,0,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,0,1,0,1
4,896,1,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,0,1,0,1

In [ ]:
gender_survived = titanic_data.groupby('Sex')['Survived'].agg('count')
gender_survived.head()

Sex
female    152
male      266
Name: Survived, dtype: int64

In [15]:
survived= titanic_data[titanic_data['Survived']==1]
survived.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
1,893,1,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,0,1,0,1
4,896,1,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,0,1,0,1
6,898,1,"Connolly, Miss. Kate",0,30.0,0,0,330972,7.6292,0,1,1,0
8,900,1,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",0,18.0,0,0,2657,7.2292,0,1,0,0
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",0,23.0,1,0,21228,82.2667,0,0,0,1

In [16]:
gender_survivors = survived.groupby('Sex')['Survived'].agg('count')
gender_survivors.head()

Sex
0    152
Name: Survived, dtype: int64

In [17]:
survived['Sex'].value_counts()

Sex
0    152
Name: count, dtype: int64

In [21]:
y = titanic_data['Survived']
x = titanic_data.drop(['Survived','PassengerId','Name','Ticket'],axis=1)
x.head()

,Sex,Age,SibSp,Parch,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,1,34.5,0,0,7.8292,0,1,1,0
1,0,47.0,1,0,7.0000,0,1,0,1
2,1,62.0,0,0,9.6875,1,0,1,0
3,1,27.0,0,0,8.6625,0,1,0,1
4,0,22.0,1,1,12.2875,0,1,0,1

### Splitting our data

In [ ]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=22)

- Apply scaling and class weight balancing in the y column and evaluate the model performance
- Also fit logit (by statsmodels) and compare model performance
- class weight - imblearn -imbalanced learn(SMOTE)

### Fitting the data using logistic regression

In [24]:
lr = LogisticRegression()
model = lr.fit(x_train,y_train)

c:\Users\Sally\Documents\NJERI KIMARU LUX\Python-plus-main\my_env\Lib\site-packages\sklearn\linear_model\_logistic.py:473: ConvergenceWarning: lbfgs failed to converge after 100 iteration(s) (status=1):
STOP: TOTAL NO. OF ITERATIONS REACHED LIMIT

Increase the number of iterations to improve the convergence (max_iter=100).
You might also want to scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [25]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Sex         418 non-null    int64
 1   Age         418 non-null    float64
 2   SibSp       418 non-null    int64
 3   Parch       418 non-null    int64
 4   Fare        418 non-null    float64
 5   Pclass_2    418 non-null    int64
 6   Pclass_3    418 non-null    int64
 7   Embarked_Q  418 non-null    int64
 8   Embarked_S  418 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 29.5 KB

### Metrics

In [26]:
y_pred = model.predict(x_test)

In [27]:
accuracy_score(y_pred,y_test)

1.0

In [28]:
precision_score(y_pred,y_test)

1.0

In [29]:
recall_score(y_pred,y_test)

1.0